# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#
# *Пример:*
#
# 5
#     1 2 3 4 5
#     6
#     -> 5

import random

print('Введите значение N: ')

N = int(input())

print('Введите значение X: ')

X = int(input())

my_list = []

for i in range(1, N + 1):
    my_list.append(random.randint(0, 30))

print(my_list)

closest = my_list[0]  # Предполагаем, что первый элемент самый близкий

for num in my_list:
    if abs(num - X) < abs(closest - X):
        closest = num

print(f'Самый близкий по величине элемент к заданному числу = {closest}')
